package com.xmduruo.util;

/**
 * Created by @Author tachai
 * date 2018/8/1 18:42
 *
 * @Email 1206966083@qq.com
 */
public class Test {
    public static void main(String[] args) {
        String  mm = "肯定没包含的啊;肯定没包含啊;肯定没包含呢;肯定没包含嗯;肯定没包含恩;肯定没包含啦;肯定没包含;肯定没来的啊;肯定没来啊;肯定没来呢;肯定没来嗯;肯定没来恩;肯定没来啦;肯定没来;肯定没行的啊;肯定没行啊;肯定没行呢;肯定没行嗯;肯定没行恩;肯定没行啦;肯定没行;肯定没有的啊;肯定没有啊;肯定没有呢;肯定没有嗯;肯定没有恩;肯定没有啦;肯定没有;肯定没要的啊;肯定没要啊;肯定没要呢;肯定没要嗯;肯定没要恩;肯定没要啦;肯定没要;肯定没需的啊;肯定没需啊;肯定没需呢;肯定没需嗯;肯定没需恩;肯定没需啦;肯定没需;肯定没会的啊;肯定没会啊;肯定没会呢;肯定没会嗯;肯定没会恩;肯定没会啦;肯定没会;肯定没是的啊;肯定没是啊;肯定没是呢;肯定没是嗯;肯定没是恩;肯定没是啦;肯定没是;肯定没好的啊;肯定没好啊;肯定没好呢;肯定没好嗯;肯定没好恩;肯定没好啦;肯定没好;肯定没办的啊;肯定没办啊;肯定没办呢;肯定没办嗯;肯定没办恩;肯定没办啦;肯定没办;肯定没能的啊;肯定没能啊;肯定没能呢;肯定没能嗯;肯定没能恩;肯定没能啦;肯定没能;肯定没对的啊;肯定没对啊;肯定没对呢;肯定没对嗯;肯定没对恩;肯定没对啦;肯定没对;肯定没在的啊;肯定没在啊;肯定没在呢;肯定没在嗯;肯定没在恩;肯定没在啦;肯定没在;肯定没含的啊;肯定没含啊;肯定没含呢;肯定没含嗯;肯定没含恩;肯定没含啦;肯定没含;肯定没中的啊;肯定没中啊;肯定没中呢;肯定没中嗯;肯定没中恩;肯定没中啦;肯定没中;肯定没成的啊;肯定没成啊;肯定没成呢;肯定没成嗯;肯定没成恩;肯定没成啦;肯定没成;肯定没的啊;肯定没啊;肯定没呢;肯定没嗯;肯定没恩;肯定没啦;肯定没;肯定不包含的啊;肯定不包含啊;肯定不包含呢;肯定不包含嗯;肯定不包含恩;肯定不包含啦;肯定不包含;肯定不来的啊;肯定不来啊;肯定不来呢;肯定不来嗯;肯定不来恩;肯定不来啦;肯定不来;肯定不行的啊;肯定不行啊;肯定不行呢;肯定不行嗯;肯定不行恩;肯定不行啦;肯定不行;肯定不有的啊;肯定不有啊;肯定不有呢;肯定不有嗯;肯定不有恩;肯定不有啦;肯定不有;肯定不要的啊;肯定不要啊;肯定不要呢;肯定不要嗯;肯定不要恩;肯定不要啦;肯定不要;肯定不需的啊;肯定不需啊;肯定不需呢;肯定不需嗯;肯定不需恩;肯定不需啦;肯定不需;肯定不会的啊;肯定不会啊;肯定不会呢;肯定不会嗯;肯定不会恩;肯定不会啦;肯定不会;肯定不是的啊;肯定不是啊;肯定不是呢;肯定不是嗯;肯定不是恩;肯定不是啦;肯定不是;肯定不好的啊;肯定不好啊;肯定不好呢;肯定不好嗯;肯定不好恩;肯定不好啦;肯定不好;肯定不办的啊;肯定不办啊;肯定不办呢;肯定不办嗯;肯定不办恩;肯定不办啦;肯定不办;肯定不能的啊;肯定不能啊;肯定不能呢;肯定不能嗯;肯定不能恩;肯定不能啦;肯定不能;肯定不对的啊;肯定不对啊;肯定不对呢;肯定不对嗯;肯定不对恩;肯定不对啦;肯定不对;肯定不在的啊;肯定不在啊;肯定不在呢;肯定不在嗯;肯定不在恩;肯定不在啦;肯定不在;肯定不含的啊;肯定不含啊;肯定不含呢;肯定不含嗯;肯定不含恩;肯定不含啦;肯定不含;肯定不中的啊;肯定不中啊;肯定不中呢;肯定不中嗯;肯定不中恩;肯定不中啦;肯定不中;肯定不成的啊;肯定不成啊;肯定不成呢;肯定不成嗯;肯定不成恩;肯定不成啦;肯定不成;肯定不的啊;肯定不啊;肯定不呢;肯定不嗯;肯定不恩;肯定不啦;肯定不;肯定未包含的啊;肯定未包含啊;肯定未包含呢;肯定未包含嗯;肯定未包含恩;肯定未包含啦;肯定未包含;肯定未来的啊;肯定未来啊;肯定未来呢;肯定未来嗯;肯定未来恩;肯定未来啦;肯定未来;肯定未行的啊;肯定未行啊;肯定未行呢;肯定未行嗯;肯定未行恩;肯定未行啦;肯定未行;肯定未有的啊;肯定未有啊;肯定未有呢;肯定未有嗯;肯定未有恩;肯定未有啦;肯定未有;肯定未要的啊;肯定未要啊;肯定未要呢;肯定未要嗯;肯定未要恩;肯定未要啦;肯定未要;肯定未需的啊;肯定未需啊;肯定未需呢;肯定未需嗯;肯定未需恩;肯定未需啦;肯定未需;肯定未会的啊;肯定未会啊;肯定未会呢;肯定未会嗯;肯定未会恩;肯定未会啦;肯定未会;肯定未是的啊;肯定未是啊;肯定未是呢;肯定未是嗯;肯定未是恩;肯定未是啦;肯定未是;肯定未好的啊;肯定未好啊;肯定未好呢;肯定未好嗯;肯定未好恩;肯定未好啦;肯定未好;肯定未办的啊;肯定未办啊;肯定未办呢;肯定未办嗯;肯定未办恩;肯定未办啦;肯定未办;肯定未能的啊;肯定未能啊;肯定未能呢;肯定未能嗯;肯定未能恩;肯定未能啦;肯定未能;肯定未对的啊;肯定未对啊;肯定未对呢;肯定未对嗯;肯定未对恩;肯定未对啦;肯定未对;肯定未在的啊;肯定未在啊;肯定未在呢;肯定未在嗯;肯定未在恩;肯定未在啦;肯定未在;肯定未含的啊;肯定未含啊;肯定未含呢;肯定未含嗯;肯定未含恩;肯定未含啦;肯定未含;肯定未中的啊;肯定未中啊;肯定未中呢;肯定未中嗯;肯定未中恩;肯定未中啦;肯定未中;肯定未成的啊;肯定未成啊;肯定未成呢;肯定未成嗯;肯定未成恩;肯定未成啦;肯定未成;肯定未的啊;肯定未啊;肯定未呢;肯定未嗯;肯定未恩;肯定未啦;肯定未;肯定别包含的啊;肯定别包含啊;肯定别包含呢;肯定别包含嗯;肯定别包含恩;肯定别包含啦;肯定别包含;肯定别来的啊;肯定别来啊;肯定别来呢;肯定别来嗯;肯定别来恩;肯定别来啦;肯定别来;肯定别行的啊;肯定别行啊;肯定别行呢;肯定别行嗯;肯定别行恩;肯定别行啦;肯定别行;肯定别有的啊;肯定别有啊;肯定别有呢;肯定别有嗯;肯定别有恩;肯定别有啦;肯定别有;肯定别要的啊;肯定别要啊;肯定别要呢;肯定别要嗯;肯定别要恩;肯定别要啦;肯定别要;肯定别需的啊;肯定别需啊;肯定别需呢;肯定别需嗯;肯定别需恩;肯定别需啦;肯定别需;肯定别会的啊;肯定别会啊;肯定别会呢;肯定别会嗯;肯定别会恩;肯定别会啦;肯定别会;肯定别是的啊;肯定别是啊;肯定别是呢;肯定别是嗯;肯定别是恩;肯定别是啦;肯定别是;肯定别好的啊;肯定别好啊;肯定别好呢;肯定别好嗯;肯定别好恩;肯定别好啦;肯定别好;肯定别办的啊;肯定别办啊;肯定别办呢;肯定别办嗯;肯定别办恩;肯定别办啦;肯定别办;肯定别能的啊;肯定别能啊;肯定别能呢;肯定别能嗯;肯定别能恩;肯定别能啦;肯定别能;肯定别对的啊;肯定别对啊;肯定别对呢;肯定别对嗯;肯定别对恩;肯定别对啦;肯定别对;肯定别在的啊;肯定别在啊;肯定别在呢;肯定别在嗯;肯定别在恩;肯定别在啦;肯定别在;肯定别含的啊;肯定别含啊;肯定别含呢;肯定别含嗯;肯定别含恩;肯定别含啦;肯定别含;肯定别中的啊;肯定别中啊;肯定别中呢;肯定别中嗯;肯定别中恩;肯定别中啦;肯定别中;肯定别成的啊;肯定别成啊;肯定别成呢;肯定别成嗯;肯定别成恩;肯定别成啦;肯定别成;肯定别的啊;肯定别啊;肯定别呢;肯定别嗯;肯定别恩;肯定别啦;肯定别;肯定莫包含的啊;肯定莫包含啊;肯定莫包含呢;肯定莫包含嗯;肯定莫包含恩;肯定莫包含啦;肯定莫包含;肯定莫来的啊;肯定莫来啊;肯定莫来呢;肯定莫来嗯;肯定莫来恩;肯定莫来啦;肯定莫来;肯定莫行的啊;肯定莫行啊;肯定莫行呢;肯定莫行嗯;肯定莫行恩;肯定莫行啦;肯定莫行;肯定莫有的啊;肯定莫有啊;肯定莫有呢;肯定莫有嗯;肯定莫有恩;肯定莫有啦;肯定莫有;肯定莫要的啊;肯定莫要啊;肯定莫要呢;肯定莫要嗯;肯定莫要恩;肯定莫要啦;肯定莫要;肯定莫需的啊;肯定莫需啊;肯定莫需呢;肯定莫需嗯;肯定莫需恩;肯定莫需啦;肯定莫需;肯定莫会的啊;肯定莫会啊;肯定莫会呢;肯定莫会嗯;肯定莫会恩;肯定莫会啦;肯定莫会;肯定莫是的啊;肯定莫是啊;肯定莫是呢;肯定莫是嗯;肯定莫是恩;肯定莫是啦;肯定莫是;肯定莫好的啊;肯定莫好啊;肯定莫好呢;肯定莫好嗯;肯定莫好恩;肯定莫好啦;肯定莫好;肯定莫办的啊;肯定莫办啊;肯定莫办呢;肯定莫办嗯;肯定莫办恩;肯定莫办啦;肯定莫办;肯定莫能的啊;肯定莫能啊;肯定莫能呢;肯定莫能嗯;肯定莫能恩;肯定莫能啦;肯定莫能;肯定莫对的啊;肯定莫对啊;肯定莫对呢;肯定莫对嗯;肯定莫对恩;肯定莫对啦;肯定莫对;肯定莫在的啊;肯定莫在啊;肯定莫在呢;肯定莫在嗯;肯定莫在恩;肯定莫在啦;肯定莫在;肯定莫含的啊;肯定莫含啊;肯定莫含呢;肯定莫含嗯;肯定莫含恩;肯定莫含啦;肯定莫含;肯定莫中的啊;肯定莫中啊;肯定莫中呢;肯定莫中嗯;肯定莫中恩;肯定莫中啦;肯定莫中;肯定莫成的啊;肯定莫成啊;肯定莫成呢;肯定莫成嗯;肯定莫成恩;肯定莫成啦;肯定莫成;肯定莫的啊;肯定莫啊;肯定莫呢;肯定莫嗯;肯定莫恩;肯定莫啦;肯定莫;没包含的啊;没包含啊;没包含呢;没包含嗯;没包含恩;没包含啦;没包含;没来的啊;没来啊;没来呢;没来嗯;没来恩;没来啦;没来;没行的啊;没行啊;没行呢;没行嗯;没行恩;没行啦;没行;没有的啊;没有啊;没有呢;没有嗯;没有恩;没有啦;没有;没要的啊;没要啊;没要呢;没要嗯;没要恩;没要啦;没要;没需的啊;没需啊;没需呢;没需嗯;没需恩;没需啦;没需;没会的啊;没会啊;没会呢;没会嗯;没会恩;没会啦;没会;没是的啊;没是啊;没是呢;没是嗯;没是恩;没是啦;没是;没好的啊;没好啊;没好呢;没好嗯;没好恩;没好啦;没好;没办的啊;没办啊;没办呢;没办嗯;没办恩;没办啦;没办;没能的啊;没能啊;没能呢;没能嗯;没能恩;没能啦;没能;没对的啊;没对啊;没对呢;没对嗯;没对恩;没对啦;没对;没在的啊;没在啊;没在呢;没在嗯;没在恩;没在啦;没在;没含的啊;没含啊;没含呢;没含嗯;没含恩;没含啦;没含;没中的啊;没中啊;没中呢;没中嗯;没中恩;没中啦;没中;没成的啊;没成啊;没成呢;没成嗯;没成恩;没成啦;没成;没的啊;没啊;没呢;没嗯;没恩;没啦;没;不包含的啊;不包含啊;不包含呢;不包含嗯;不包含恩;不包含啦;不包含;不来的啊;不来啊;不来呢;不来嗯;不来恩;不来啦;不来;不行的啊;不行啊;不行呢;不行嗯;不行恩;不行啦;不行;不有的啊;不有啊;不有呢;不有嗯;不有恩;不有啦;不有;不要的啊;不要啊;不要呢;不要嗯;不要恩;不要啦;不要;不需的啊;不需啊;不需呢;不需嗯;不需恩;不需啦;不需;不会的啊;不会啊;不会呢;不会嗯;不会恩;不会啦;不会;不是的啊;不是啊;不是呢;不是嗯;不是恩;不是啦;不是;不好的啊;不好啊;不好呢;不好嗯;不好恩;不好啦;不好;不办的啊;不办啊;不办呢;不办嗯;不办恩;不办啦;不办;不能的啊;不能啊;不能呢;不能嗯;不能恩;不能啦;不能;不对的啊;不对啊;不对呢;不对嗯;不对恩;不对啦;不对;不在的啊;不在啊;不在呢;不在嗯;不在恩;不在啦;不在;不含的啊;不含啊;不含呢;不含嗯;不含恩;不含啦;不含;不中的啊;不中啊;不中呢;不中嗯;不中恩;不中啦;不中;不成的啊;不成啊;不成呢;不成嗯;不成恩;不成啦;不成;不的啊;不啊;不呢;不嗯;不恩;不啦;不;未包含的啊;未包含啊;未包含呢;未包含嗯;未包含恩;未包含啦;未包含;未来的啊;未来啊;未来呢;未来嗯;未来恩;未来啦;未来;未行的啊;未行啊;未行呢;未行嗯;未行恩;未行啦;未行;未有的啊;未有啊;未有呢;未有嗯;未有恩;未有啦;未有;未要的啊;未要啊;未要呢;未要嗯;未要恩;未要啦;未要;未需的啊;未需啊;未需呢;未需嗯;未需恩;未需啦;未需;未会的啊;未会啊;未会呢;未会嗯;未会恩;未会啦;未会;未是的啊;未是啊;未是呢;未是嗯;未是恩;未是啦;未是;未好的啊;未好啊;未好呢;未好嗯;未好恩;未好啦;未好;未办的啊;未办啊;未办呢;未办嗯;未办恩;未办啦;未办;未能的啊;未能啊;未能呢;未能嗯;未能恩;未能啦;未能;未对的啊;未对啊;未对呢;未对嗯;未对恩;未对啦;未对;未在的啊;未在啊;未在呢;未在嗯;未在恩;未在啦;未在;未含的啊;未含啊;未含呢;未含嗯;未含恩;未含啦;未含;未中的啊;未中啊;未中呢;未中嗯;未中恩;未中啦;未中;未成的啊;未成啊;未成呢;未成嗯;未成恩;未成啦;未成;未的啊;未啊;未呢;未嗯;未恩;未啦;未;别包含的啊;别包含啊;别包含呢;别包含嗯;别包含恩;别包含啦;别包含;别来的啊;别来啊;别来呢;别来嗯;别来恩;别来啦;别来;别行的啊;别行啊;别行呢;别行嗯;别行恩;别行啦;别行;别有的啊;别有啊;别有呢;别有嗯;别有恩;别有啦;别有;别要的啊;别要啊;别要呢;别要嗯;别要恩;别要啦;别要;别需的啊;别需啊;别需呢;别需嗯;别需恩;别需啦;别需;别会的啊;别会啊;别会呢;别会嗯;别会恩;别会啦;别会;别是的啊;别是啊;别是呢;别是嗯;别是恩;别是啦;别是;别好的啊;别好啊;别好呢;别好嗯;别好恩;别好啦;别好;别办的啊;别办啊;别办呢;别办嗯;别办恩;别办啦;别办;别能的啊;别能啊;别能呢;别能嗯;别能恩;别能啦;别能;别对的啊;别对啊;别对呢;别对嗯;别对恩;别对啦;别对;别在的啊;别在啊;别在呢;别在嗯;别在恩;别在啦;别在;别含的啊;别含啊;别含呢;别含嗯;别含恩;别含啦;别含;别中的啊;别中啊;别中呢;别中嗯;别中恩;别中啦;别中;别成的啊;别成啊;别成呢;别成嗯;别成恩;别成啦;别成;别的啊;别啊;别呢;别嗯;别恩;别啦;别;莫包含的啊;莫包含啊;莫包含呢;莫包含嗯;莫包含恩;莫包含啦;莫包含;莫来的啊;莫来啊;莫来呢;莫来嗯;莫来恩;莫来啦;莫来;莫行的啊;莫行啊;莫行呢;莫行嗯;莫行恩;莫行啦;莫行;莫有的啊;莫有啊;莫有呢;莫有嗯;莫有恩;莫有啦;莫有;莫要的啊;莫要啊;莫要呢;莫要嗯;莫要恩;莫要啦;莫要;莫需的啊;莫需啊;莫需呢;莫需嗯;莫需恩;莫需啦;莫需;莫会的啊;莫会啊;莫会呢;莫会嗯;莫会恩;莫会啦;莫会;莫是的啊;莫是啊;莫是呢;莫是嗯;莫是恩;莫是啦;莫是;莫好的啊;莫好啊;莫好呢;莫好嗯;莫好恩;莫好啦;莫好;莫办的啊;莫办啊;莫办呢;莫办嗯;莫办恩;莫办啦;莫办;莫能的啊;莫能啊;莫能呢;莫能嗯;莫能恩;莫能啦;莫能;莫对的啊;莫对啊;莫对呢;莫对嗯;莫对恩;莫对啦;莫对;莫在的啊;莫在啊;莫在呢;莫在嗯;莫在恩;莫在啦;莫在;莫含的啊;莫含啊;莫含呢;莫含嗯;莫含恩;莫含啦;莫含;莫中的啊;莫中啊;莫中呢;莫中嗯;莫中恩;莫中啦;莫中;莫成的啊;莫成啊;莫成呢;莫成嗯;莫成恩;莫成啦;莫成;莫的啊;莫啊;莫呢;莫嗯;莫恩;莫啦;莫;肯定没;肯定否;肯定不;肯定非;肯定未;肯定别;肯定莫;肯定无;没;否;不;非;未;别;莫;无";
        String temp ="";
        String[] mmS = mm.split(";");
        for(int i=0;i<mmS.length;i++){
            System.out.println(TestJson.testQuery("我要卖酒"));
            String str1 =TestJson.testQuery(mmS[i]);
            System.out.println(mmS[i]);
            System.out.println(str1);
            if(str1.indexOf("如果有需要")>-1){

            }else {
                temp += "-"+mmS[i];
            }

            WeChatParseJson.clearSession("oX5hwwLxeGMcvKcu-Qk9YMsDfpQQ");
            WeChatParseJson.clearTask("oX5hwwLxeGMcvKcu-Qk9YMsDfpQQ","酒类办理流程");

//            否  如果有需要
//            是  请问您是


        }
        System.out.println(temp);
    }
}
